[Survived] BlockStatement
src/controllers/document.ts:27:51
    * DocumentError(401, "Unauthorized")
    * DocumentError(500, "Internal Server Error")
    */
-  permissions(): DocumentResponse | DocumentError {
-    if (this.StoreName == "" || this.UserClaim == "") { // What happens if " "?
-      throw new DocumentError(400, "Bad Request");
-    } else if (this.StoreName != this.UserClaim) {
-      throw new DocumentError(401, "Unauthorized");
-    } else if (this.StoreName == this.UserClaim) {
-      this.permission = true;
-      return new DocumentResponse(200, "OK");
-    } else {
-      throw new DocumentError(500, "Internal Server Error");
-    }
-  }
+  permissions(): DocumentResponse | DocumentError {}
 }
 

[Survived] ConditionalExpression
src/controllers/document.ts:28:9
    * DocumentError(500, "Internal Server Error")
    */
   permissions(): DocumentResponse | DocumentError {
-    if (this.StoreName == "" || this.UserClaim == "") { // What happens if " "?
+    if (false || this.UserClaim == "") { // What happens if " "?
       throw new DocumentError(400, "Bad Request");
     } else if (this.StoreName != this.UserClaim) {

[Survived] ConditionalExpression
src/controllers/document.ts:28:9
    * DocumentError(500, "Internal Server Error")
    */
   permissions(): DocumentResponse | DocumentError {
-    if (this.StoreName == "" || this.UserClaim == "") { // What happens if " "?
+    if (false) { // What happens if " "?
       throw new DocumentError(400, "Bad Request");
     } else if (this.StoreName != this.UserClaim) {

[Survived] EqualityOperator
src/controllers/document.ts:30:16
   permissions(): DocumentResponse | DocumentError {
     if (this.StoreName == "" || this.UserClaim == "") { // What happens if " "?
       throw new DocumentError(400, "Bad Request");
-    } else if (this.StoreName != this.UserClaim) {
+    } else if (this.StoreName == this.UserClaim) {
       throw new DocumentError(401, "Unauthorized");
     } else if (this.StoreName == this.UserClaim) {

[Survived] ConditionalExpression
src/controllers/document.ts:30:16
   permissions(): DocumentResponse | DocumentError {
     if (this.StoreName == "" || this.UserClaim == "") { // What happens if " "?
       throw new DocumentError(400, "Bad Request");
-    } else if (this.StoreName != this.UserClaim) {
+    } else if (true) {
       throw new DocumentError(401, "Unauthorized");
     } else if (this.StoreName == this.UserClaim) {

[Survived] EqualityOperator
src/controllers/document.ts:32:16
       throw new DocumentError(400, "Bad Request");
     } else if (this.StoreName != this.UserClaim) {
       throw new DocumentError(401, "Unauthorized");
-    } else if (this.StoreName == this.UserClaim) {
+    } else if (this.StoreName != this.UserClaim) {
       this.permission = true;
       return new DocumentResponse(200, "OK");

[Survived] ConditionalExpression
src/controllers/document.ts:32:16
       throw new DocumentError(400, "Bad Request");
     } else if (this.StoreName != this.UserClaim) {
       throw new DocumentError(401, "Unauthorized");
-    } else if (this.StoreName == this.UserClaim) {
+    } else if (true) {
       this.permission = true;
       return new DocumentResponse(200, "OK");

[Survived] BooleanLiteral
src/controllers/document.ts:33:25
     } else if (this.StoreName != this.UserClaim) {
       throw new DocumentError(401, "Unauthorized");
     } else if (this.StoreName == this.UserClaim) {
-      this.permission = true;
+      this.permission = false;
       return new DocumentResponse(200, "OK");
     } else {

[NoCoverage] BlockStatement
src/controllers/document.ts:35:12
     } else if (this.StoreName == this.UserClaim) {
       this.permission = true;
       return new DocumentResponse(200, "OK");
-    } else {
-      throw new DocumentError(500, "Internal Server Error");
-    }
+    } else {}
   }
 }

[NoCoverage] StringLiteral
src/controllers/document.ts:36:36
       this.permission = true;
       return new DocumentResponse(200, "OK");
     } else {
-      throw new DocumentError(500, "Internal Server Error");
+      throw new DocumentError(500, "");
     }
   }
