[Survived] BlockStatement
src/controllers/document.ts:17:5
   constructor(
     public readonly StoreName: string,
     public readonly UserClaim: User["storeName"],
-  ) {
-    this.init();
-  }
+  ) {}
 
   /**

[Survived] BlockStatement
src/controllers/document.ts:29:32
    * DocumentError(400, "Bad Request")
    * DocumentError(500, "Internal Server Error")
    */
-  init(): void | DocumentError {
-    if (!this.StoreName || !this.UserClaim) {
-      throw new DocumentError(400, "Bad Request");
-    } else if (this.StoreName.trim() === "" || this.UserClaim.trim() === "") {
-      throw new DocumentError(400, "Bad Request");
-    }
-  }
+  init(): void | DocumentError {}
 
   /**

[Survived] LogicalOperator
src/controllers/document.ts:30:9
    * DocumentError(500, "Internal Server Error")
    */
   init(): void | DocumentError {
-    if (!this.StoreName || !this.UserClaim) {
+    if (!this.StoreName && !this.UserClaim) {
       throw new DocumentError(400, "Bad Request");
     } else if (this.StoreName.trim() === "" || this.UserClaim.trim() === "") {

[Survived] ConditionalExpression
src/controllers/document.ts:30:9
    * DocumentError(500, "Internal Server Error")
    */
   init(): void | DocumentError {
-    if (!this.StoreName || !this.UserClaim) {
+    if (true) {
       throw new DocumentError(400, "Bad Request");
     } else if (this.StoreName.trim() === "" || this.UserClaim.trim() === "") {

[Survived] MethodExpression
src/controllers/document.ts:32:48
   init(): void | DocumentError {
     if (!this.StoreName || !this.UserClaim) {
       throw new DocumentError(400, "Bad Request");
-    } else if (this.StoreName.trim() === "" || this.UserClaim.trim() === "") {
+    } else if (this.StoreName.trim() === "" || this.UserClaim === "") {
       throw new DocumentError(400, "Bad Request");
     }

[Survived] BlockStatement
src/controllers/document.ts:32:78
   init(): void | DocumentError {
     if (!this.StoreName || !this.UserClaim) {
       throw new DocumentError(400, "Bad Request");
-    } else if (this.StoreName.trim() === "" || this.UserClaim.trim() === "") {
-      throw new DocumentError(400, "Bad Request");
-    }
+    } else if (this.StoreName.trim() === "" || this.UserClaim.trim() === "") {}
   }
 

[Survived] BlockStatement
src/controllers/document.ts:46:51
    * DocumentError(401, "Unauthorized")
    * DocumentError(500, "Internal Server Error")
    */
-  permissions(): DocumentResponse | DocumentError {
-    if (this.StoreName != this.UserClaim) {
-      throw new DocumentError(401, "Unauthorized");
-    } else if (this.StoreName == this.UserClaim) {
-      this.permission = true;
-      return new DocumentResponse(200, "OK");
-    } else {
-      throw new DocumentError(500, "Internal Server Error");
-    }
-  }
+  permissions(): DocumentResponse | DocumentError {}
 }
 

[Survived] ConditionalExpression
src/controllers/document.ts:47:9
    * DocumentError(500, "Internal Server Error")
    */
   permissions(): DocumentResponse | DocumentError {
-    if (this.StoreName != this.UserClaim) {
+    if (true) {
       throw new DocumentError(401, "Unauthorized");
     } else if (this.StoreName == this.UserClaim) {

[Survived] EqualityOperator
src/controllers/document.ts:47:9
    * DocumentError(500, "Internal Server Error")
    */
   permissions(): DocumentResponse | DocumentError {
-    if (this.StoreName != this.UserClaim) {
+    if (this.StoreName == this.UserClaim) {
       throw new DocumentError(401, "Unauthorized");
     } else if (this.StoreName == this.UserClaim) {
